In [1]:
import pandas as pd

In [2]:
employees = pd.read_csv('~/user_audit/data/employees.csv')
employees

,employee_number,first_name,last_name,email,title
0,EMP003037,Juliana,Burbudge,juliana.burbudge@consultants.com,Director of Sales
1,EMP003045,Lizzie,Blue,lizzie.blue@consultants.com,Sales Assistant
2,EMP003051,Marjory,Selcraig,marjory.selcraig@consultants.com,Sales Assistant
3,EMP003068,Aguste,O'Connor,aguste.o'connor@consultants.com,Sales Assistant
4,EMP003097,Clemens,Kopman,clemens.kopman@consultants.com,Account Manager
...,...,...,...,...,...
970,EMP024864,Kristina,Yakov,kristina.yakov@consultants.com,Sales Assistant
971,EMP024885,Margarita,Habbergham,margarita.habbergham@consultants.com,Account Manager
972,EMP024890,Prescott,Southward,prescott.southward@consultants.com,Sales Assistant
973,EMP024896,Raine,Learned,raine.learned@consultants.com,Account Manager
974,EMP024931,Frederique,Fant,frederique.fant@consultants.com,Account Manager

In [3]:
system_access = pd.read_csv('~/user_audit/data/system_access.csv')
system_access

        id    access_level
0     3045  Contract Entry
1     3051  Contract Entry
2     3068  Contract Entry
3     3097   Account Admin
4     3133  Contract Entry
..     ...             ...
833  24862  Contract Entry
834  24864  Contract Entry
835  24885   Account Admin
836  24890  Contract Entry
837  24896   Account Admin

[838 rows x 2 columns]

In [4]:
system_access1 = system_access.drop(['id'],axis=1)
system_access1

       access_level
0    Contract Entry
1    Contract Entry
2    Contract Entry
3     Account Admin
4    Contract Entry
..              ...
833  Contract Entry
834  Contract Entry
835   Account Admin
836  Contract Entry
837   Account Admin

[838 rows x 1 columns]

In [5]:
result = pd.concat([system_access1,employees],sort = False)
result

,access_level,employee_number,first_name,last_name,email,title
0,Contract Entry,NaN,NaN,NaN,NaN,NaN
1,Contract Entry,NaN,NaN,NaN,NaN,NaN
2,Contract Entry,NaN,NaN,NaN,NaN,NaN
3,Account Admin,NaN,NaN,NaN,NaN,NaN
4,Contract Entry,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...
970,NaN,EMP024864,Kristina,Yakov,kristina.yakov@consultants.com,Sales Assistant
971,NaN,EMP024885,Margarita,Habbergham,margarita.habbergham@consultants.com,Account Manager
972,NaN,EMP024890,Prescott,Southward,prescott.southward@consultants.com,Sales Assistant
973,NaN,EMP024896,Raine,Learned,raine.learned@consultants.com,Account Manager
974,NaN,EMP024931,Frederique,Fant,frederique.fant@consultants.com,Account Manager

In [6]:
result.isnull().sum()

access_level       975
employee_number    838
first_name         838
last_name          838
email              838
title              838
dtype: int64

In [7]:
result.isnull().any()

access_level       True
employee_number    True
first_name         True
last_name          True
email              True
title              True
dtype: bool

In [8]:
x = result[result.isnull().any(axis=1)]
x.head()

     access_level employee_number first_name last_name email title
0  Contract Entry             NaN        NaN       NaN   NaN   NaN
1  Contract Entry             NaN        NaN       NaN   NaN   NaN
2  Contract Entry             NaN        NaN       NaN   NaN   NaN
3   Account Admin             NaN        NaN       NaN   NaN   NaN
4  Contract Entry             NaN        NaN       NaN   NaN   NaN

result.loc[result['title'] == "Sales Assistant", ' access_level] = "Contract Entry"
result.loc[result['title'] == "Account Manager", ' access_level] = "Account Admin"
result.loc[result['title'] == "Director of Sales", ' access_level] = "Aproval Manager"
result.head()